app/Models/M_Guru.php

SELECT *
FROM `gurulogin`
JOIN `guru` ON `gurulogin`.`id_guru` = `guru`.`id`
JOIN `role` ON `guru`.`id_role` = `role`.`id_role`
WHERE `username` = 'adminSistem'
AND `password` = '4452d71687b6bc2c9389c3349fdc17fbd73b833b'
---
	function login_teacher($data)
	{
		return $this->db->table('gurulogin')
			->join('guru', 'gurulogin.id_guru = guru.id')
			->join('role', 'guru.id_role = role.id_role')
			->where('username', $data['username'])
			->where('password', $data['password'])
			->get()->getRowArray();

SELECT *
FROM `gurulogin`
JOIN `guru` ON `gurulogin`.`id_guru` = `guru`.`id`
JOIN `role` ON `guru`.`id_role` = `role`.`id_role`
WHERE `guru`.`id_role` = 4
---
	function getAllTeacher()
	{
		return $this->db->table('gurulogin')
			->join('guru', 'gurulogin.id_guru = guru.id')
			->join('role', 'guru.id_role = role.id_role')
			->where('guru.id_role', 4)
			->get()->getResultArray();