app/Models/M_Kelas.php

	function allClass()
	{
		return $this->db->table('kelas as c')
			->select('c.id, c.kelas, c.id_guru, g.nama')
			->join('guru as g', 'c.id_guru = g.id')
			->get()->getResultArray();
---
SELECT `c`.`id`, `c`.`kelas`, `c`.`id_guru`, `g`.`nama`
FROM `kelas` as `c`
JOIN `guru` as `g` ON `c`.`id_guru` = `g`.`id`