app/Models/M_Mapel.php

	function allSubject()
	{
		return $this->db->table('mapel as s')
			->select('s.id, s.code, s.name,s.id_guru, g.nama')
			->join('guru as g', 's.id_guru = g.id')
			->get()->getResultArray();
---
SELECT `s`.`id`, `s`.`code`, `s`.`name`, `s`.`id_guru`, `g`.`nama`
FROM `mapel` as `s`
JOIN `guru` as `g` ON `s`.`id_guru` = `g`.`id`