app/Models/M_Murid.php

	function login_student($data)
	{
		return $this->db->table('muridlogin')
			->join('murid', 'muridlogin.id_murid = murid.id')
			->join('role', 'murid.id_role = role.id_role')
			->join('kelas', 'murid.id_class = kelas.id')
			->where('username', $data['username'])
			->where('password', $data['password'])
			->get()->getRowArray();
---
SELECT *
FROM `muridlogin`
JOIN `murid` ON `muridlogin`.`id_murid` = `murid`.`id`
JOIN `role` ON `murid`.`id_role` = `role`.`id_role`
JOIN `kelas` ON `murid`.`id_class` = `kelas`.`id`
WHERE `username` = 'adminSistem'
AND `password` = '4452d71687b6bc2c9389c3349fdc17fbd73b833b'

	function getAllStudent()
	{
		return $this->db->table('muridlogin')
			->join('murid', 'muridlogin.id_murid = murid.id')
			->join('role', 'murid.id_role = role.id_role')
			->join('kelas', 'murid.id_class = kelas.id')
			->where('murid.id_role', 5)
			->get()->getResultArray();
---
SELECT *
FROM `muridlogin`
JOIN `murid` ON `muridlogin`.`id_murid` = `murid`.`id`
JOIN `role` ON `murid`.`id_role` = `role`.`id_role`
JOIN `kelas` ON `murid`.`id_class` = `kelas`.`id`
WHERE `murid`.`id_role` = 5