app/Models/M_Soal.php

	function findQuestion($id)
	{
		return $this->db->table('soal')
			->select('soal.*')
			->orderBy('rand()')
			->get()->getResultArray();
---
SELECT `soal`.*
FROM `soal`
ORDER BY rand()